[
    {
        "Question ID": "cecbdeba",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Area and volume",
        "Question Difficulty": "Medium",
        "Item Stem": "A right circular cylinder has a volume of $432$ cubic centimeters. The area of the base of the cylinder is $24$ square centimeters.",
        "Question": "What is the height, in centimeters, of the cylinder?",
        "Choice A": "$18$",
        "Choice B": "$24$",
        "Choice C": "$216$",
        "Choice D": "$10,368$",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. The volume, $V$, of a right circular cylinder is given by the formula $V = \\pi r^2 h$, where $\\pi r^2$ is the area of the base of the cylinder and $h$ is the height. It's given that a right circular cylinder has a volume of $432$ cubic centimeters and the area of the base is $24$ square centimeters. Substituting $432$ for $V$ and $24$ for $\\pi r^2$ in the formula $V = \\pi r^2 h$ yields $432 = 24 h$. Dividing both sides of this equation by $24$ yields $18 = h$. Therefore, the height of the cylinder, in centimeters, is $18$. Choice B is incorrect. This is the area of the base, in square centimeters, not the height, in centimeters, of the cylinder. Choice C is incorrect. This is the height, in centimeters, of a cylinder if its volume is $432$ cubic centimeters and the area of its base is $2$, not $24$, cubic centimeters. Choice D is incorrect. This is the height, in centimeters, of a cylinder if its volume is $432$ cubic centimeters and the area of its base is $\\frac{1}{24}$, not $24$, cubic centimeters.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "38517165",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Area and volume",
        "Question Difficulty": "Medium",
        "Item Stem": "A circle has a circumference of $31\\pi$ centimeters.",
        "Question": "What is the diameter, in centimeters, of the circle?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": "31",
        "Rationale": "The correct answer is $31$ . The circumference of a circle is equal to $2\\pi r$ centimeters, where $r$ represents the radius, in centimeters, of the circle, and the diameter of the circle is equal to $2r$ centimeters. It's given that a circle has a circumference of $31\\pi$ centimeters. Therefore, $31\\pi = 2\\pi r$ . Dividing both sides of this equation by $\\pi$ yields $31 = 2r$ . Since the diameter of the circle is equal to $2r$ centimeters, it follows that the diameter, in centimeters, of the circle is $31$ .",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "c88183f7",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Area and volume",
        "Question Difficulty": "Easy",
        "Item Stem": "A rectangle has a length of $13$ and a width of $6$.",
        "Question": "What is the perimeter of the rectangle?",
        "Choice A": "$12$",
        "Choice B": "$26$",
        "Choice C": "$38$",
        "Choice D": "$52$",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. The perimeter of a quadrilateral is the sum of the lengths of its four sides. It's given that the rectangle has a length of $13$ and a width of $6$. It follows that the rectangle has two sides with length $13$ and two sides with length $6$. Therefore, the perimeter of the rectangle is $13 + 13 + 6 + 6$, or $38$. Choice A is incorrect. This is the sum of the lengths of the two sides with length $6$, not the sum of the lengths of all four sides of the rectangle. Choice B is incorrect. This is the sum of the lengths of the two sides with length $13$, not the sum of the lengths of all four sides of the rectangle. Choice D is incorrect. This is the perimeter of a rectangle that has four sides with length $13$, not two sides with length $13$ and two sides with length $6$.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "9d159400",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Circles",
        "Question Difficulty": "Hard",
        "Item Stem": "",
        "Question": "Which of the following equations represents a circle in the xy -plane that intersects the y -axis at exactly one point?",
        "Choice A": "$(x-8)^2 + (y-8)^2 = 16$",
        "Choice B": "$(x-8)^2 + (y-4)^2 = 16$",
        "Choice C": "$(x-4)^2 + (y-9)^2 = 16$",
        "Choice D": "$x^2 + (y-9)^2 = 16$",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. The graph of the equation $(x-h)^2 + (y-k)^2 = r^2$ in the xy -plane is a circle with center $(h,k)$ and a radius of length $r$. The radius of a circle is the distance from the center of the circle to any point on the circle. If a circle in the xy -plane intersects the y -axis at exactly one point, then the perpendicular distance from the center of the circle to this point on the y -axis must be equal to the length of the circle's radius. It follows that the x -coordinate of the circle's center must be equivalent to the length of the circle's radius. In other words, if the graph of $(x-h)^2 + (y-k)^2 = r^2$ is a circle that intersects the y -axis at exactly one point, then $r = \\left| h \\right|$ must be true. The equation in choice C is $(x-4)^2 + (y-9)^2 = 16$, or $(x-4)^2 + (y-9)^2 = 4^2$. This equation is in the form $(x-h)^2 + (y-k)^2 = r^2$, where $h=4$, $k=9$, and $r=4$, and represents a circle in the xy -plane with center $(4,9)$ and radius of length $4$. Substituting $4$ for $r$ and $4$ for $h$ in the equation $r = \\left| h \\right|$ yields $4 = \\left|4\\right|$, or $4 = 4$, which is true. Therefore, the equation in choice C represents a circle in the xy -plane that intersects the y -axis at exactly one point. Choice A is incorrect. This is the equation of a circle that does not intersect the y -axis at any point. Choice B is incorrect. This is an equation of a circle that intersects the x -axis, not the y -axis, at exactly one point. Choice D is incorrect. This is the equation of a circle with the center located on the y -axis and thus intersects the y -axis at exactly two points, not exactly one point.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "24cec8d1",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Circles",
        "Question Difficulty": "Hard",
        "Item Stem": "A circle has center $O$ , and points $R$ and $S$ lie on the circle. In triangle $ORS$ , the measure of $\\angle ROS$ is $88^\\circ$ . ",
        "Question": "What is the measure of $\\angle RSO$ , in degrees. (Disregard the degree symbol when entering your answer)?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": "46",
        "Rationale": "The correct answer is $46$. It's given that $O$ is the center of a circle and that points $R$ and $S$ lie on the circle. Therefore, $\\overline{OR}$ and $\\overline{OS}$ are radii of the circle. It follows that $OR = OS$. If two sides of a triangle are congruent, then the angles opposite them are congruent. It follows that the angles $\\angle RSO$ and $\\angle ORS$, which are across from the sides of equal length, are congruent. Let $x^\\circ$ represent the measure of $\\angle RSO$. It follows that the measure of $\\angle ORS$ is also $x^\\circ$. It's given that the measure of $\\angle ROS$ is $88^\\circ$. Because the sum of the measures of the interior angles of a triangle is $180^\\circ$, the equation $x^\\circ + x^\\circ + 88^\\circ = 180^\\circ$, or $2x + 88 = 180$, can be used to find the measure of $\\angle RSO$. Subtracting $88$ from both sides of this equation yields $2x = 92$. Dividing both sides of this equation by $2$ yields $x = 46$. Therefore, the measure of $\\angle RSO$, in degrees, is $46$.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "856372ca",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Circles",
        "Question Difficulty": "Medium",
        "Item Stem": "In the xy -plane, a circle with radius 5 has center $(-8,6)$.",
        "Question": "Which of the following is an equation of the circle?",
        "Choice A": "$(x-8)^2 + (y+6)^2 = 25$",
        "Choice B": "$(x+8)^2 + (y-6)^2 = 25$",
        "Choice C": "$(x-8)^2 + (y+6)^2 = 5$",
        "Choice D": "$(x+8)^2 + (y-6)^2 = 5$",
        "Correct Answer": "B",
        "Rationale": "Choice B is correct. An equation of a circle is $(x-h)^2 + (y-k)^2 = r^2$ , where the center of the circle is $(h, k)$ and the radius is r . It's given that the center of this circle is $(-8,6)$ and the radius is 5. Substituting these values into the equation gives $(x+8)^2 + (y-6)^2 = 5^2$ , or $(x+8)^2 + (y-6)^2 = 25$ . Choice A is incorrect. This is an equation of a circle that has center $(8,-6)$ . Choice C is incorrect. This is an equation of a circle that has center $(8,-6)$ and radius $\\sqrt{5}$ . Choice D is incorrect. This is an equation of a circle that has radius $\\sqrt{5}$ .",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "294db8ec",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Advanced Math",
        "Skill": "Equivalent expressions",
        "Question Difficulty": "Easy",
        "Item Stem": "",
        "Question": "Which of the following is equivalent to $2x^{3} + 4$?",
        "Choice A": "$4 \\times (x^{3} + 4)$",
        "Choice B": "$4 \\times (x^{3} + 2)$",
        "Choice C": "$2 \\times (x^{3} + 4)$",
        "Choice D": "$2 \\times (x^{3} + 2)$",
        "Correct Answer": "D",
        "Rationale": "Choice D is correct. The expression $2x^{3} + 4$ has two terms, $2x^{3}$ and 4. The greatest common factor of these two terms is 2. Factoring 2 from each of these terms yields $2 \\times x^{3} + 2 \\times 2$, or $2 \\times (x^{3} + 2)$. Choices A and B are incorrect because 4 is not a factor of the term $2x^{3}$. Choice C is incorrect and may result from factoring 2 from $2x^{3}$ but not from 4.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "b74f2feb",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Advanced Math",
        "Skill": "Equivalent expressions",
        "Question Difficulty": "Hard",
        "Item Stem": "The expression $6 \\sqrt[5]{3^{5}x^{45}} \\cdot \\sqrt[8]{2^{8}x}$ is equivalent to $a x^{b}$ , where $a$ and $b$ are positive constants and $x > 1$.",
        "Question": "What is the value of $a + b$?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": "361/8,  45.12,  45.13",
        "Rationale": "The correct answer is $\\frac{361}{8}$ . The rational exponent property is $\\sqrt[n]{y^{m}} = y^{\\frac{m}{n}}$ , where $y > 0$ , $m$ and $n$ are integers, and $n > 0$ . This property can be applied to rewrite the given expression $6 \\sqrt[5]{3^{5}x^{45}} \\cdot \\sqrt[8]{2^{8}x}$ as $6 (3^{\\frac{5}{5}}) (x^{\\frac{45}{5}}) (2^{\\frac{8}{8}}) (x^{\\frac{1}{8}})$ , or $6 (3) (x^{9}) (2) (x^{\\frac{1}{8}})$ . This expression can be rewritten by multiplying the constants, which gives $36 (x^{9}) (x^{\\frac{1}{8}})$ . The multiplication exponent property is $y^{n} \\cdot y^{m} = y^{n + m}$ , where $y > 0$ . This property can be applied to rewrite the expression $36 (x^{9}) (x^{\\frac{1}{8}})$ as $36 x^{9 + \\frac{1}{8}}$ , or $36 x^{\\frac{73}{8}}$ . Therefore, $6 \\sqrt[5]{3^{5}x^{45}} \\cdot \\sqrt[8]{2^{8}x} = 36 x^{\\frac{73}{8}}$ . It's given that $6 \\sqrt[5]{3^{5}x^{45}} \\cdot \\sqrt[8]{2^{8}x}$ is equivalent to $a x^{b}$ ; therefore, $a = 36$ and $b = \\frac{73}{8}$ . It follows that $a + b = 36 + \\frac{73}{8}$ . Finding a common denominator on the right-hand side of this equation gives $a + b = \\frac{288}{8} + \\frac{73}{8}$ , or $a + b = \\frac{361}{8}$ . Note that 361/8, 45.12, and 45.13 are examples of ways to enter a correct answer.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "6e06a0a7",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Advanced Math",
        "Skill": "Equivalent expressions",
        "Question Difficulty": "Easy",
        "Item Stem": "",
        "Question": "Which of the following expressions is equivalent to $2a^{2}(a+3)$?",
        "Choice A": "$5a^{3}$",
        "Choice B": "$8a^{5}$",
        "Choice C": "$2a^{3} + 3$",
        "Choice D": "$2a^{3} + 6a^{2}$",
        "Correct Answer": "D",
        "Rationale": "Choice D is correct. Expanding the given expression using the distributive property yields $2a^{2} \\cdot a + 2a^{2} \\cdot 3$ . Combining like terms yields $2a^{2} \\cdot (a^{1}) + (2 \\times 3) \\cdot (a^{2})$ , or $2a^{2+1} + 6a^{2}$ , which is equivalent to $2a^{3} + 6a^{2}$ . Choices A and B are incorrect and may result from incorrectly combining like terms. Choice C is incorrect and may result from distributing $2a^{2}$ only to a , and not to 3, in the given expression.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "aa43b41f",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Evaluating statistical claims: Observational studies and experiments",
        "Question Difficulty": "Hard",
        "Item Stem": "Near the end of a US cable news show, the host invited viewers to respond to a poll on the show's website that asked, ``Do you support the new federal policy discussed during the show.'' At the end of the show, the host reported that 28\\% responded ``Yes,'' and 70\\% responded ``No.''",
        "Question": " Which of the following best explains why the results are unlikely to represent the sentiments of the population of the United States?",
        "Choice A": "The percentages do not add up to 100\\%, so any possible conclusions from the poll are invalid.",
        "Choice B": "Those who responded to the poll were not a random sample of the population of the United States.",
        "Choice C": "There were not 50\\% ``Yes'' responses and 50\\% ``No'' responses.",
        "Choice D": "The show did not allow viewers enough time to respond to the poll.",
        "Correct Answer": "B",
        "Rationale": "Choice B is correct. In order for the poll results from a sample of a population to represent the entire population, the sample must be representative of the population. A sample that is randomly selected from a population is more likely than a sample of the type described to represent the population. In this case, the people who responded were people with access to cable television and websites, which aren't accessible to the entire population. Moreover, the people who responded also chose to watch the show and respond to the poll. The people who made these choices aren't representative of the entire population of the United States because they were not a random sample of the population of the United States. Choices A, C, and D are incorrect because they present reasons unrelated to whether the sample is representative of the population of the United States.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "37930b2a",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Evaluating statistical claims: Observational studies and experiments",
        "Question Difficulty": "Medium",
        "Item Stem": "Residents of a town were surveyed to determine whether they are satisfied with the concession stand at the local park. A random sample of 200 residents was selected. All 200 responded, and 87\\% said they are satisfied. Based on this information, which of the following statements must be true. I. Of all the town residents, 87\\% would say they are satisfied with the concession stand at the local park. II.",
        "Question": "If another random sample of 200 residents were surveyed, 87\\% would say they are satisfied?",
        "Choice A": "Neither",
        "Choice B": "I only",
        "Choice C": "II only",
        "Choice D": "I and II",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. The purpose of surveying a random sample of residents is to approximate the percent of the town residents that are satisfied with the concession stand. The sample doesn't necessarily get the same result as surveying every resident of the town, nor would another sample necessarily have identical results. Therefore, although it's possible that either statement I or statement II could prove true by surveying every resident of the town, these statements cannot be proven true solely based on the results of the sample. Choice B is incorrect because surveying a sample of the town residents may not have the same result as surveying all the town residents. Choices C and D are incorrect because surveying a different sample of residents could yield different results.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "1ea09200",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Evaluating statistical claims: Observational studies and experiments",
        "Question Difficulty": "Hard",
        "Item Stem": "A sample of 40 fourth-grade students was selected at random from a certain school. The 40 students completed a survey about the morning announcements, and 32 thought the announcements were helpful.",
        "Question": "Which of the following is the largest population to which the results of the survey can be applied?",
        "Choice A": "The 40 students who were surveyed",
        "Choice B": "All fourth-grade students at the school",
        "Choice C": "All students at the school",
        "Choice D": "All fourth-grade students in the county in which the school is located",
        "Correct Answer": "B",
        "Rationale": "Choice B is correct. Selecting a sample of a reasonable size at random to use for a survey allows the results from that survey to be applied to the population from which the sample was selected, but not beyond this population. In this case, the population from which the sample was selected is all fourth-grade students at a certain school. Therefore, the results of the survey can be applied to all fourth-grade students at the school. Choice A is incorrect. The results of the survey can be applied to the 40 students who were surveyed. However, this isn't the largest group to which the results of the survey can be applied. Choices C and D are incorrect. Since the sample was selected at random from among the fourth-grade students at a certain school, the results of the survey can't be applied to other students at the school or to other fourth-grade students who weren't represented in the survey results. Students in other grades in the school or other fourth-grade students in the country may feel differently about announcements than the fourth-grade students at the school.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "53d97af5",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Inference from sample statistics and margin of error",
        "Question Difficulty": "Medium",
        "Item Stem": "A study was done on the weights of different types of fish in a pond. A random sample of fish were caught and marked in order to ensure that none were weighed more than once. The sample contained 150 largemouth bass, of which 30\\% weighed more than 2 pounds.",
        "Question": "Which of the following conclusions is best supported by the sample data?",
        "Choice A": "The majority of all fish in the pond weigh less than 2 pounds.",
        "Choice B": "The average weight of all fish in the pond is approximately 2 pounds.",
        "Choice C": "Approximately 30\\% of all fish in the pond weigh more than 2 pounds.",
        "Choice D": "Approximately 30\\% of all largemouth bass in the pond weigh more than 2 pounds.",
        "Correct Answer": "D",
        "Rationale": "Choice D is correct. The sample of 150 largemouth bass was selected at random from all the largemouth bass in the pond, and since 30\\% of the fish in the sample weighed more than 2 pounds, it can be concluded that approximately 30\\% of all largemouth bass in the pond weigh more than 2 pounds. Choices A, B, and C are incorrect. Since the sample contained 150 largemouth bass, of which 30\\% weighed more than 2 pounds, this result can be generalized only to largemouth bass in the pond, not to all fish in the pond.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "e03f3477",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Inference from sample statistics and margin of error",
        "Question Difficulty": "Medium",
        "Item Stem": "A sample consisting of $720$ adults who own televisions was selected at random for a study. Based on the sample, it is estimated that $32\\%$ of all adults who own televisions use their televisions to watch nature shows, with an associated margin of error of $3.41\\%$.",
        "Question": "Which of the following is the most plausible conclusion about all adults who own televisions?",
        "Choice A": "More than $35.41\\%$ of all adults who own televisions use their televisions to watch nature shows.",
        "Choice B": "Between $28.59\\%$ and $35.41\\%$ of all adults who own televisions use their televisions to watch nature shows.",
        "Choice C": "Since the sample included adults who own televisions and not just those who use their televisions to watch nature shows, no conclusion can be made.",
        "Choice D": "Since the sample did not include all the people who watch nature shows, no conclusion can be made.",
        "Correct Answer": "B",
        "Rationale": "Choice B is correct. It's given that based on a sample selected at random, it's estimated that $32\\%$ of all adults who own televisions use their televisions to watch nature shows, with an associated margin of error of $3.41\\%$. Subtracting the margin of error from the estimate and adding the margin of error to the estimate gives an interval of plausible values for the true percentage of adults who own televisions who use their televisions to watch nature shows. This means it's plausible that between $32\\% - 3.41\\%$, or $28.59\\%$, and $32\\% + 3.41\\%$, or $35.41\\%$, of all adults who own televisions use their televisions to watch nature shows. Therefore, of the given choices, the most plausible conclusion is that between $28.59\\%$ and $35.41\\%$ of all adults who own televisions use their televisions to watch nature shows. Choice A is incorrect and may result from conceptual errors. Choice C is incorrect. To make a plausible conclusion about all adults who own televisions, the sample must be selected at random from all adults who own televisions, not just those who use their televisions to watch nature shows. Choice D is incorrect. Since the sample was selected at random from all adults who own televisions, a plausible conclusion can be made about all adults who own televisions.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "916ffe9b",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Inference from sample statistics and margin of error",
        "Question Difficulty": "Hard",
        "Item Stem": "The table shows the results of a poll. A total of $803$ voters selected at random were asked which candidate they would vote for in the upcoming election.",
        "Question": "According to the poll, if $6,424$ people vote in the election, by how many votes would Angel Cruz be expected to win?",
        "Choice A": "$163$",
        "Choice B": "$1,304$",
        "Choice C": "$3,864$",
        "Choice D": "$5,621$",
        "Correct Answer": "B",
        "Rationale": "Choice B is correct. It's given that $483$ out of $803$ voters responded that they would vote for Angel Cruz. Therefore, the proportion of voters from the poll who responded they would vote for Angel Cruz is $\\frac{483}{803}$. It's also given that there are a total of $6,424$ voters in the election. Therefore, the total number of people who would be expected to vote for Angel Cruz is $6,424 (\\frac{483}{803})$, or $3,864$. Since $3,864$ of the $6,424$ total voters would be expected to vote for Angel Cruz, it follows that $6,424 - 3,864$, or $2,560$ voters would be expected not to vote for Angel Cruz. The difference in the number of votes for and against Angel Cruz is $3,864 - 2,560$, or $1,304$ votes. Therefore, if $6,424$ people vote in the election, Angel Cruz would be expected to win by $1,304$ votes. Choice A is incorrect. This is the difference in the number of voters from the poll who responded that they would vote for and against Angel Cruz. Choice C is incorrect. This is the total number of people who would be expected to vote for Angel Cruz. Choice D is incorrect. This is the difference between the total number of people who vote in the election and the number of voters from the poll.",
        "Table": "\\textbf{Poll Results} \\\\ \\begin{tabular}{|l|c|} \\hline Candidate & Votes \\\\ \\hline Angel Cruz & 483 \\\\ Terry Smith & 320 \\\\ \\hline \\end{tabular} \\end{center}",
        "Figure": ""
    },
    {
        "Question ID": "2f0a43b2",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear equations in one variable",
        "Question Difficulty": "Easy",
        "Item Stem": "",
        "Question": "If $\\frac{x}{8}=5$ , what is the value of $\\frac{8}{x}$?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": ".2,  1/5",
        "Rationale": "The correct answer is $\\frac{1}{5}$ . Since the number $5$ can also be written as $\\frac{5}{1}$ , the given equation can also be written as $\\frac{x}{8}=\\frac{5}{1}$ . This equation is equivalent to $\\frac{8}{x}=\\frac{1}{5}$ . Therefore, the value of $\\frac{8}{x}$ is $\\frac{1}{5}$ . Note that 1/5 and .2 are examples of ways to enter a correct answer. Alternate approach: Multiplying both sides of the equation $\\frac{x}{8}=5$ by $8$ yields $x=40$ . Substituting $40$ for $x$ into the expression $\\frac{8}{x}$ yields $\\frac{8}{40}$ , or $\\frac{1}{5}$ .",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "620abf36",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear equations in one variable",
        "Question Difficulty": "Medium",
        "Item Stem": "",
        "Question": "If $5 (x+4)=4 (x+4)+29$ , what is the value of $x+4$?",
        "Choice A": "$-4$",
        "Choice B": "$25$",
        "Choice C": "$29$",
        "Choice D": "$33$",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. Subtracting $4 (x+4)$ from both sides of the given equation yields $1 (x+4)=29$ , or $x+4=29$ . Therefore, the value of $x+4$ is $29$ . Choice A is incorrect and may result from conceptual or calculation errors. Choice B is incorrect. This is the value of $x$ , not $x+4$ . Choice D is incorrect and may result from conceptual or calculation errors.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "8c515062",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear equations in one variable",
        "Question Difficulty": "Medium",
        "Item Stem": "A candle is made of $17$ ounces of wax. When the candle is burning, the amount of wax in the candle decreases by $1$ ounce every $4$ hours.",
        "Question": "If $6$ ounces of wax remain in this candle, for how many hours has it been burning?",
        "Choice A": "$3$",
        "Choice B": "$6$",
        "Choice C": "$24$",
        "Choice D": "$44$",
        "Correct Answer": "D",
        "Rationale": "Choice D is correct. It's given that the candle starts with $17$ ounces of wax and has $6$ ounces of wax remaining after a period of time has passed. The amount of wax the candle has lost during the time period can be found by subtracting the remaining amount of wax from the amount of wax the candle was made of, which yields $17 - 6$ ounces, or $11$ ounces. This means the candle loses $11$ ounces of wax during that period of time. It's given that the amount of wax decreases by $1$ ounce every $4$ hours. If $h$ represents the number of hours the candle has been burning, it follows that $\\frac{1}{4} = \\frac{11}{h}$ . Multiplying both sides of this equation by $4 h$ yields $h = 44$ . Therefore, the candle has been burning for $44$ hours. Choice A is incorrect and may result from using the equation $\\frac{1}{4} = \\frac{h}{11}$ rather than $\\frac{1}{4} = \\frac{11}{h}$ to represent the situation, and then rounding to the nearest whole number. Choice B is incorrect. This is the amount of wax, in ounces, remaining in the candle, not the number of hours it has been burning. Choice C is incorrect and may result from using the equation $\\frac{1}{4} = \\frac{6}{h}$ rather than $\\frac{1}{4} = \\frac{11}{h}$ to represent the situation.",
        "Figure": "",
        "Table": ""
    },
    {
        "Question ID": "2d0e13a6",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear equations in two variables",
        "Question Difficulty": "Easy",
        "Item Stem": "Line $k$ is defined by $y=\\frac{1}{4}x+1$ . Line $j$ is parallel to line $k$ in the xy -plane.",
        "Question": "What is the slope of $j$?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": ".25,  1/4",
        "Rationale": "The correct answer is $\\frac{1}{4}$ . It's given that line $k$ is defined by $y=\\frac{1}{4}x+1$ . It's also given that line $j$ is parallel to line $k$ in the xy -plane. A line in the xy -plane represented by an equation in slope-intercept form $y=mx+b$ has a slope of $m$ and a y -intercept of $(0, b)$ . Therefore, the slope of line $k$ is $\\frac{1}{4}$ . Since parallel lines have equal slopes, the slope of line $j$ is $\\frac{1}{4}$ . Note that 1/4 and .25 are examples of ways to enter a correct answer.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "c6b151d4",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear equations in two variables",
        "Question Difficulty": "Easy",
        "Item Stem": "A total of $364$ paper straws of equal length were used to construct two types of polygons: triangles and rectangles. The triangles and rectangles were constructed so that no two polygons had a common side. The equation $3x + 4y=364$ represents this situation, where $x$ is the number of triangles constructed and $y$ is the number of rectangles constructed.",
        "Question": "What is the best interpretation of $(x,y)=(24,73)$ in this context?",
        "Choice A": "If $24$ triangles were constructed, then $73$ rectangles were constructed.",
        "Choice B": "If $24$ triangles were constructed, then $73$ paper straws were used.",
        "Choice C": "If $73$ triangles were constructed, then $24$ rectangles were constructed.",
        "Choice D": "If $73$ triangles were constructed, then $24$ paper straws were used.",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. It's given that $364$ paper straws of equal length were used to construct triangles and rectangles, where no two polygons had a common side. It's also given that the equation $3x + 4y=364$ represents this situation, where $x$ is the number of triangles constructed and $y$ is the number of rectangles constructed. The equation $(x,y)=(24,73)$ means that if $x=24$, then $y=73$. Substituting $24$ for $x$ and $73$ for $y$ in $3x + 4y=364$ yields $3(24) + 4(73) = 364$, or $364=364$, which is true. Therefore, in this context, the equation $(x,y)=(24,73)$ means that if $24$ triangles were constructed, then $73$ rectangles were constructed. Choice B is incorrect and may result from conceptual errors. Choice C is incorrect and may result from conceptual errors. Choice D is incorrect and may result from conceptual errors.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "7038b587",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear equations in two variables",
        "Question Difficulty": "Easy",
        "Item Stem": "Vivian bought party hats and cupcakes for $\\$71$ . Each package of party hats cost $\\$3$ , and each cupcake cost $\\$1$.",
        "Question": "If Vivian bought $10$ packages of party hats, how many cupcakes did she buy?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": "41",
        "Rationale": "The correct answer is $41$ . The number of cupcakes Vivian bought can be found by first finding the amount Vivian spent on cupcakes. The amount Vivian spent on cupcakes can be found by subtracting the amount Vivian spent on party hats from the total amount Vivian spent. The amount Vivian spent on party hats can be found by multiplying the cost per package of party hats by the number of packages of party hats, which yields $\\$3.10$, or $\\$30$ . Subtracting the amount Vivian spent on party hats, $\\$30$, from the total amount Vivian spent, $\\$71$, yields $\\$71 - \\$30$, or $\\$41$ . Since the amount Vivian spent on cupcakes was $\\$41$ and each cupcake cost $\\$1$, it follows that Vivian bought $41$ cupcakes.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "1d18794b",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear functions",
        "Question Difficulty": "Easy",
        "Item Stem": "A contract for a certain service requires a onetime activation cost of $35$ and a monthly cost of $23$.",
        "Question": "Which equation represents this situation, where $c$ is the total cost, in dollars, of this service contract for $t$ months?",
        "Choice A": "$c = \\frac{t}{23} + 35$",
        "Choice B": "$c = \\frac{t}{35} + 23$",
        "Choice C": "$c = 23 t + 35$",
        "Choice D": "$c = 35 t + 23$",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. It's given that this service contract requires a monthly cost of $23$ . A monthly cost of $23$ for $t$ months results in a cost of $23 t$ . It's also given that this service contract requires a onetime activation cost of $35$ . Adding the onetime activation cost to the monthly cost of the service contract for $t$ months yields the total cost $c$, in dollars, of this service contract for $t$ months. Therefore, this situation can be represented by the equation $c = 23 t + 35$ . Choice A is incorrect and may result from conceptual or calculation errors. Choice B is incorrect and may result from conceptual or calculation errors. Choice D is incorrect and may result from conceptual or calculation errors.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "06fc1726",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear functions",
        "Question Difficulty": "Easy",
        "Item Stem": "",
        "Question": "If f is the function defined by $f(x)=\\frac{2x-1}{3}$, what is the value of $f(5)$?",
        "Choice A": "$\\frac{4}{3}$",
        "Choice B": "$\\frac{7}{3}$",
        "Choice C": "3",
        "Choice D": "9",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. If $f(x)=\\frac{2x-1}{3}$, then $f(5)=\\frac{2\\times5-1}{3}=\\frac{10-1}{3}=\\frac{9}{3}=3$. Choice A is incorrect and may result from not multiplying x by 2 in the numerator. Choice B is incorrect and may result from dividing 2x by 3 and then subtracting 1. Choice D is incorrect and may result from evaluating only the numerator 2x - 1.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "113b938e",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear functions",
        "Question Difficulty": "Medium",
        "Item Stem": "The equation above represents the speed y, in feet per second, of Sheila's bicycle x seconds after she applied the brakes at the end of a ride.",
        "Question": "If the equation is graphed in the xy-plane, which of the following is the best interpretation of the x-coordinate of the line's x-intercept in the context of the problem?",
        "Choice A": "The speed of Sheila's bicycle, in feet per second, before Sheila applied the brakes",
        "Choice B": "The number of feet per second the speed of Sheila's bicycle decreased each second after Sheila applied the brakes",
        "Choice C": "The number of seconds it took from the time Sheila began applying the brakes until the bicycle came to a complete stop",
        "Choice D": "The number of feet Sheila's bicycle traveled from the time she began applying the brakes until the bicycle came to a complete stop",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. It's given that for each point $(x,y)$ on the graph of the given equation, the x-coordinate represents the number of seconds after Sheila applied the brakes, and the y-coordinate represents the speed of Sheila's bicycle at that moment in time. For the graph of the equation, the y-coordinate of the x-intercept is 0. Therefore, the x-coordinate of the x-intercept of the graph of the given equation represents the number of seconds it took from the time Sheila began applying the brakes until the bicycle came to a complete stop. Choice A is incorrect. The speed of Sheila's bicycle before she applied the brakes is represented by the y-coordinate of the y-intercept of the graph of the given equation, not the x-coordinate of the x-intercept. Choice B is incorrect. The number of feet per second the speed of Sheila's bicycle decreased each second after Sheila applied the brakes is represented by the slope of the graph of the given equation, not the x-coordinate of the x-intercept. Choice D is incorrect and may result from misinterpreting x as the distance, in feet, traveled after applying the brakes, rather than the time, in seconds, after applying the brakes.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "b1228811",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear inequalities in one or two variables",
        "Question Difficulty": "Medium",
        "Item Stem": "Marisa needs to hire at least 10 staff members for an upcoming project. The staff members will be made up of junior directors, who will be paid \\$640 per week, and senior directors, who will be paid \\$880 per week. Her budget for paying the staff members is no more than \\$9,700 per week. She must hire at least 3 junior directors and at least 1 senior director.",
        "Question": "Which of the following systems of inequalities represents the conditions described if x is the number of junior directors and y is the number of senior directors?",
        "Choice A": "$640x + 880y \\geq 9,700$ \\\\ $x + y \\leq 10$ \\\\ $x \\geq 3$ \\\\ $y \\geq 1$",
        "Choice B": "$640x + 880y \\leq 9,700$ \\\\ $x + y \\geq 10$ \\\\ $x \\geq 3$ \\\\ $y \\geq 1$",
        "Choice C": "$640x + 880y \\geq 9,700$ \\\\ $x + y \\geq 10$ \\\\ $x \\leq 3$ \\\\ $y \\leq 1 $",
        "Choice D": "$640x + 880y \\leq 9,700$ \\\\ $x + y \\leq 10$ \\\\ $x \\leq 3$ \\\\ $y \\leq 1$",
        "Correct Answer": "B",
        "Rationale": "Choice B is correct. Marisa will hire x junior directors and y senior directors. Since she needs to hire at least 10 staff members, $x + y \\geq 10$ . Each junior director will be paid \\$640 per week, and each senior director will be paid \\$880 per week. Marisa's budget for paying the new staff is no more than \\$9,700 per week; in terms of x and y , this condition is $640x + 880y \\leq 9700$. Since Marisa must hire at least 3 junior directors and at least 1 senior director, it follows that $x \\geq 3$ and $y \\geq 1$ . All four of these conditions are represented correctly in choice B. Choices A and C are incorrect. For example, the first condition, $640x + 880y \\geq 9700$ , in each of these options implies that Marisa can pay the new staff members more than her budget of \\$9,700. Choice D is incorrect because Marisa needs to hire at least 10 staff members, not at most 10 staff members, as the inequality $x + y \\leq 10$ implies.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "6c71f3ec",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear inequalities in one or two variables",
        "Question Difficulty": "Hard",
        "Item Stem": "A salesperson's total earnings consist of a base salary of $x$ dollars per year, plus commission earnings of $0.11$ of the total sales the salesperson makes during the year. This year, the salesperson has a goal for the total earnings to be at least $3$ times and at most $4$ times the base salary.",
        "Question": "Which of the following inequalities represents all possible values of total sales $s$, in dollars, the salesperson can make this year in order to meet that goal?",
        "Choice A": "$2x \\leq s \\leq 3x$",
        "Choice B": "$\\frac{2}{0.11}x \\leq s \\leq \\frac{3}{0.11}x$",
        "Choice C": "$3x \\leq s \\leq 4x$",
        "Choice D": "$\\frac{3}{0.11}x \\leq s \\leq \\frac{4}{0.11}x$",
        "Correct Answer": "B",
        "Rationale": "Choice B is correct. It's given that a salesperson's total earnings consist of a base salary of $x$ dollars per year plus commission earnings of $0.11$ of the total sales the salesperson makes during the year. If the salesperson makes $s$ dollars in total sales this year, the salesperson's total earnings can be represented by the expression $x + 0.11s$. It's also given that the salesperson has a goal for the total earnings to be at least $3$ times and at most $4$ times the base salary, which can be represented by the expressions $3x$ and $4x$, respectively. Therefore, this situation can be represented by the inequality $3x \\leq x + 0.11s \\leq 4x$. Subtracting $x$ from each part of this inequality yields $2x \\leq 0.11s \\leq 3x$. Dividing each part of this inequality by $0.11$ yields $\\frac{2}{0.11}x \\leq s \\leq \\frac{3}{0.11}x$. Therefore, the inequality $\\frac{2}{0.11}x \\leq s \\leq \\frac{3}{0.11}x$ represents all possible values of total sales $s$, in dollars, the salesperson can make this year in order to meet their goal. Choice A is incorrect. This inequality represents a situation in which the total sales, rather than the total earnings, are at least $2$ times and at most $3$ times, rather than at least $3$ times and at most $4$ times, the base salary. Choice C is incorrect. This inequality represents a situation in which the total sales, rather than the total earnings, are at least $3$ times and at most $4$ times the base salary. Choice D is incorrect. This inequality represents a situation in which the total earnings are at least $4$ times and at most $5$ times, rather than at least $3$ times and at most $4$ times, the base salary.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "86f7483f",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Linear inequalities in one or two variables",
        "Question Difficulty": "Easy",
        "Item Stem": "During spring migration, a dragonfly traveled a minimum of $1,510$ miles and a maximum of $4,130$ miles between stopover locations.",
        "Question": "Which inequality represents this situation, where $d$ is a possible distance, in miles, this dragonfly traveled between stopover locations during spring migration?",
        "Choice A": "$d \\leq 1,510$",
        "Choice B": "$1,510 \\leq d \\leq 4,130$",
        "Choice C": "$d \\geq 4,130$",
        "Choice D": "$4,130 \\leq d \\leq 5,640$",
        "Correct Answer": "B",
        "Rationale": "Choice B is correct. It's given that during spring migration, a dragonfly traveled a minimum of $1,510$ miles and a maximum of $4,130$ miles between stopover locations. It's also given that $d$ represents a possible distance, in miles, this dragonfly traveled between stopover locations. It follows that the inequality $1,510 \\leq d \\leq 4,130$ represents this situation. Choice A is incorrect. This inequality represents a situation in which a dragonfly traveled a maximum of $1,510$ miles between stopover locations. Choice C is incorrect. This inequality represents a situation in which a dragonfly traveled a minimum of $4,130$ miles between stopover locations. Choice D is incorrect. This inequality represents a situation in which a dragonfly traveled a minimum of $4,310$ miles and a maximum of $5,640$ miles between stopover locations.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "739f1bbc",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Lines, angles, and triangles",
        "Question Difficulty": "Easy",
        "Item Stem": "In triangle $\\triangle ABC$ , $AB=4680\\text{ mm}$ and $BC=4680\\text{ mm}$.",
        "Question": "Which statement is sufficient to prove that triangle $\\triangle ABC$ is equilateral?",
        "Choice A": "$AC=4680\\text{ mm}$",
        "Choice B": "$AC=468\\text{ mm}$",
        "Choice C": "$AC=46.8\\text{ mm}$",
        "Choice D": "$AC=4.68\\text{ mm}$",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. In an equilateral triangle, all three sides have the same length. It's given that in triangle $\\triangle ABC$ , $AB=4680\\text{ millimeters}$ and $BC=4680\\text{ millimeters}$ . Therefore, if $AC=4680\\text{ millimeters}$ , then all three sides of triangle $\\triangle ABC$ have the same length, so triangle $\\triangle ABC$ is equilateral. Therefore, $AC=4680\\text{ millimeters}$ is sufficient to prove that triangle $\\triangle ABC$ is equilateral. Choice B is incorrect and may result from conceptual or calculation errors. Choice C is incorrect and may result from conceptual or calculation errors. Choice D is incorrect and may result from conceptual or calculation errors.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "2adbf1b1",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Lines, angles, and triangles",
        "Question Difficulty": "Medium",
        "Item Stem": "In the figure, lines $m$ and $n$ are parallel.",
        "Question": "If $x=6k+13$ and $y=8k-29$, what is the value of $z$?",
        "Choice A": "$3$",
        "Choice B": "$21$",
        "Choice C": "$41$",
        "Choice D": "$139$",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. Vertical angles, which are angles that are opposite each other when two lines intersect, are congruent. The figure shows that lines $t$ and $m$ intersect. It follows that the angle with measure $x\\circ$ and the angle with measure $y\\circ$ are vertical angles, so $x=y$. It's given that $x=6k+13$ and $y=8k-29$. Substituting $6k+13$ for $x$ and $8k-29$ for $y$ in the equation $x=y$ yields $6k+13=8k-29$. Subtracting $6k$ from both sides of this equation yields $13=2k-29$. Adding $29$ to both sides of this equation yields $42=2k$, or $2k=42$. Dividing both sides of this equation by $2$ yields $k=21$. It's given that lines $m$ and $n$ are parallel, and the figure shows that lines $m$ and $n$ are intersected by a transversal, line $t$. If two parallel lines are intersected by a transversal, then the same-side interior angles are supplementary. It follows that the same-side interior angles with measures $y\\circ$ and $z\\circ$ are supplementary, so $y + z=180$. Substituting $8k-29$ for $y$ in this equation yields $8k-29+z=180$. Substituting $21$ for $k$ in this equation yields $8(21)-29+z=180$, or $139 + z=180$. Subtracting $139$ from both sides of this equation yields $z=41$. Therefore, the value of $z$ is $41$. Choice A is incorrect and may result from conceptual or calculation errors. Choice B is incorrect. This is the value of $k$, not $z$. Choice D is incorrect. This is the value of $x$ or $y$, not $z$.",
        "Table": "",
        "Figure": "A diagram of 3 lines. Refer to long description. Clockwise from top left, the 3 lines are labeled t, m, and n. Line t intersects both line m and line n. At the intersection of line t and line m, 2 angles are labeled clockwise from top left as follows: Top right: $x\\circ$ Bottom left: $y\\circ$ At the intersection of line t and line n, 1 angle is labeled clockwise from top left as follows: Top left: $z\\circ$ A note indicates the figure is not drawn to scale."
    },
    {
        "Question ID": "5733ce30",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Lines, angles, and triangles",
        "Question Difficulty": "Easy",
        "Item Stem": "In the given figure, $AC$ extends to point D.",
        "Question": "If the measure of $\\angle BAC$ is equal to the measure of $\\angle BCA$ , what is the value of x?",
        "Choice A": "110",
        "Choice B": "70",
        "Choice C": "55",
        "Choice D": "40",
        "Correct Answer": "D",
        "Rationale": "Choice D is correct. Since \\angle BCD and \\angle BCA form a linear pair of angles, their measures sum to 180$^{\\circ}$. It's given that the measure of \\angle BCD is 110$^{\\circ}$. Therefore, $110^{\\circ} + \\angle BCA = 180^{\\circ}$. Subtracting 110$^{\\circ}$ from both sides of this equation gives the measure of $\\angle BCA$ as 70$^{\\circ}$. It's also given that the measure of $\\angle BAC$ is equal to the measure of $\\angle BCA$. Thus, the measure of $\\angle BAC$ is also 70$^{\\circ}$. The measures of the interior angles of a triangle sum to 180$^{\\circ}$. Thus, $70^{\\circ} + 70^{\\circ} + x^{\\circ} = 180^{\\circ}$. Combining like terms on the left-hand side of this equation yields $140^{\\circ} + x^{\\circ} = 180^{\\circ}$. Subtracting 140$^{\\circ}$ from both sides of this equation yields $x^{\\circ} = 40^{\\circ}$, or $x = 40$. Choice A is incorrect. This is the value of the measure of $\\angle BCD$. Choice B is incorrect. This is the value of the measure of each of the other two interior angles, $\\angle BCA$ and $\\angle BAC$. Choice C is incorrect and may result from an error made when identifying the relationship between the exterior angle of a triangle and the interior angles of the triangle.",
        "Table": "",
        "Figure": "The figure presents triangle A B C, where side A C is horizontal, vertex A is to the left of vertex C, vertex B is above side A C, and the measure of angle A B C is labeled x degrees. Side A C extends horizontally to the right to point D, and the angle, B C D, that is above line segment C D and to the right of side B C has a measure of one hundred ten degrees."
    },
    {
        "Question ID": "5910bfff",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Advanced Math",
        "Skill": "Nonlinear equations in one variable and systems of equations in two variables",
        "Question Difficulty": "Hard",
        "Item Stem": "$D = \\frac{9}{25} \\times (100 - H)$ The formula above can be used to approximate the dew point D, in degrees Fahrenheit, given the temperature T, in degrees Fahrenheit, and the relative humidity of H percent, where $H > 50$.",
        "Question": "Which of the following expresses the relative humidity in terms of the temperature and the dew point?",
        "Choice A": " $H = \\frac{25}{9} \\times (D - T) + 100 $",
        "Choice B": " $H = \\frac{25}{9} \\times (D - T) - 100 $",
        "Choice C": " $H = \\frac{25}{9} \\times (D + T) + 100 $",
        "Choice D": " $H = \\frac{25}{9} \\times (D + T) - 100 $",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. It's given that $D = T - \\frac{9}{25} \\times (100 - H)$ . Solving this formula for H expresses the relative humidity in terms of the temperature and the dew point. Subtracting T from both sides of this equation yields $D - T = -\\frac{9}{25} \\times (100 - H)$ . Multiplying both sides by $-\\frac{25}{9}$ yields $-\\frac{25}{9} \\times (D - T) = 100 - H$ . Subtracting 100 from both sides yields $-\\frac{25}{9} \\times (D - T) - 100 = -H$ . Multiplying both sides by $-1$ results in the formula $\\frac{25}{9} \\times (D - T) + 100 = H$ . Choices B, C, and D are incorrect and may result from errors made when rewriting the given formula.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "3f8d5876",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Advanced Math",
        "Skill": "Nonlinear equations in one variable and systems of equations in two variables",
        "Question Difficulty": "Easy",
        "Item Stem": "The graph of a system of a linear equation and a nonlinear equation is shown.",
        "Question": "What is the solution $(x,y)$ to this system?",
        "Choice A": " $(0,0)$",
        "Choice B": " $(0,4)$",
        "Choice C": " $(4,5)$",
        "Choice D": " $(5,0)$",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. The solution to the system of two equations corresponds to the point where the graphs of the equations intersect. The graphs of the linear equation and the nonlinear equation shown intersect at the point $(4,5)$ . Thus, the solution to the system is $(4,5)$ . Choice A is incorrect and may result from conceptual or calculation errors. Choice B is incorrect and may result from conceptual or calculation errors. Choice D is incorrect and may result from conceptual or calculation errors.",
        "Table": "",
        "Figure": "Graph of a system of a curve and a line in the x y plane with the origin labeled O. The x axis ranges from -2 to 9. The y axis ranges from -2 to 9. Refer to long description. For the curve in the system: The curve passes from quadrant 2 to quadrant 1. In quadrant 2, the curve trends up gradually to the approximate point (0,4.063). In quadrant 1: The curve trends up gradually to point (4,5). The curve then trends up sharply. The curve passes through the following points: $(3,\\frac{9}{2})$ (4,5) (5,6) For the line in the system: The line slants sharply down from left to right. The line passes through the following points: (3,9) (4,5)"
    },
    {
        "Question ID": "e8779461",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Advanced Math",
        "Skill": "Nonlinear equations in one variable and systems of equations in two variables",
        "Question Difficulty": "Medium",
        "Item Stem": "$y = x^2 + 14x + 48$ $x + 8 = 11$ The solution to the given system of equations is $( x, y )$.",
        "Question": "What is the value of $y$?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": "99",
        "Rationale": "The correct answer is $99$. In the given system of equations, the second equation is $x + 8 = 11$. Subtracting $8$ from both sides of this equation yields $x = 3$. In the given system of equations, the first equation is $y = x^2 + 14x + 48$. Substituting $3$ for $x$ in this equation yields $y = (3)^2 + 14 (3) + 48$, or $y = 99$. Therefore, the solution to the given system of equations is $( x, y ) = ( 3, 99 )$. Thus, the value of $y$ is $99$.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "3ea87153",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Advanced Math",
        "Skill": "Nonlinear functions",
        "Question Difficulty": "Easy",
        "Item Stem": "The function $g$ is defined by $g(x) = x^{2} + 9$.",
        "Question": "For which value of $x$ is $g(x) = 25$?",
        "Choice A": "$4$",
        "Choice B": "$5$",
        "Choice C": "$9$",
        "Choice D": "$13$",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. It's given that $g(x) = x^{2} + 9$ . Substituting $25$ for $g(x)$ in this equation yields $25 = x^{2} + 9$ . Subtracting $9$ from both sides of this equation yields $16 = x^{2}$ . Taking the square root of each side of this equation yields $x = \\pm 4$ . It follows that $g(x) = 25$ when the value of $x$ is $4$ or $-4$ . Only $4$ is listed among the choices. Choice B is incorrect and may result from conceptual or calculation errors. Choice C is incorrect and may result from conceptual or calculation errors. Choice D is incorrect and may result from conceptual or calculation errors.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "cc6ccd71",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Advanced Math",
        "Skill": "Nonlinear functions",
        "Question Difficulty": "Medium",
        "Item Stem": "The graph of $y = f(x)$ is shown, where the function $f$ is defined by $f(x)=ax^3 + bx^2 + cx + d$ and $a$, $b$, $c$, and $d$ are constants.",
        "Question": "For how many values of $x$ does $f(x) = 0$?",
        "Choice A": "One",
        "Choice B": "Two",
        "Choice C": "Three",
        "Choice D": "Four",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. If a value of $x$ satisfies $f(x) = 0$, the graph of $y = f(x)$ will contain a point $(x, 0)$ and thus touch the x -axis. Since there are $3$ points at which this graph touches the x -axis, there are $3$ values of $x$ for which $f(x) = 0$. Choice A is incorrect and may result from conceptual or calculation errors. Choice B is incorrect and may result from conceptual or calculation errors. Choice D is incorrect and may result from conceptual or calculation errors.",
        "Table": "",
        "Figure": "Graph of a curve in the x y plane with the origin labeled O. The x axis ranges from -8 to 8 in increments of 1, with values marked every 2 grid lines. The y axis ranges from -16 to 16 in increments of 2. Refer to long description. In quadrant 2 the curve falls sharply to cross the x axis at point (-1,0). In quadrant 3 the curve falls sharply to cross the y axis at point (0,-5.5). In quadrant 4: The curve falls gradually to a relative minimum at point (1,-7). The curve rises sharply to cross the x axis at point (4,0). In quadrant 1: The curve rises sharply to a relative maximum at point (5.5,3). The curve falls sharply to cross the x axis at point (7,0). In quadrant 4 the curve falls sharply."
    },
    {
        "Question ID": "821e724e",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Advanced Math",
        "Skill": "Nonlinear functions",
        "Question Difficulty": "Hard",
        "Item Stem": "The function $g$ is defined by $g(x)=(x+14)(t-x)$, where $t$ is a constant. In the xy -plane, the graph of $y=g(x)$ passes through the point $(24,0)$.",
        "Question": "What is the value of $g(0)$?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": "336",
        "Rationale": "The correct answer is $336$. By the zero product property, if $(x+14)(t-x)=0$, then $x+14=0$, which gives $x=-14$, or $(t-x)=0$, which gives $x=t$. Therefore, $g(x)=0$ when $x=-14$ and when $x=t$. Since the graph of $y=g(x)$ passes through the point $(24,0)$, it follows that $g(24)=0$, so $t=24$. Substituting $24$ for $t$ in the equation $g(x)=(x+14)(t-x)$ yields $g(x)=(x+14)(24-x)$. The value of $g(0)$ can be calculated by substituting $0$ for $x$ in this equation, which yields $g(0)=(0+14)(24-0)$, or $g(0)=336$.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "c88e0663",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "One-variable data: Distributions and measures of center and spread",
        "Question Difficulty": "Easy",
        "Item Stem": "For a school fund-raiser, 10 students sold a total of 90 boxes of cookies.",
        "Question": "Which of the following can be calculated from this information?",
        "Choice A": "The average number of boxes sold per student",
        "Choice B": "The median number of boxes sold per student",
        "Choice C": "The greatest number of boxes sold by one student",
        "Choice D": "The least number of boxes sold by one student",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. The average can be found by dividing the total number of boxes sold by the number of students, which is $\\frac{90}{10}=9$ . Choices B, C, and D are incorrect. Each results from choosing measures that require the results of individual students, which are not given.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "881ef5f5",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "One-variable data: Distributions and measures of center and spread",
        "Question Difficulty": "Medium",
        "Item Stem": "",
        "Question": "If a is the mean and b is the median of nine consecutive integers, what is the value of $\\left|a - b\\right|$?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": "0",
        "Rationale": "The correct answer is 0. Any nine consecutive integers can be written as $k$ , $k+1$ , $k+2$ , $k+3$ , $k+4$ , $k+5$ , $k+6$ , $k+7$ , $k+8$ . The mean of the integers is their sum divided by 9: $\\frac{(k + (k+1) + (k+2) + \\dots + (k+8))}{9} = \\frac{(9k + 36)}{9}$ , which simplifies to $k+4$ . So $a = k+4$ . Since there is an odd number of integers (nine), the median is the integer in the middle when all the integers are ordered from least to greatest: $k+4$ . So $b = k+4$ . Therefore, $\\left|a - b\\right| = \\left|(k+4) - (k+4)\\right|$ , which is 0.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "d3b9c8d8",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "One-variable data: Distributions and measures of center and spread",
        "Question Difficulty": "Hard",
        "Item Stem": "The box plots summarize the masses, in kilograms, of two groups of gazelles.",
        "Question": "Based on the box plots, which of the following statements must be true?",
        "Choice A": "The mean mass of group 1 is greater than the mean mass of group 2.",
        "Choice B": "The mean mass of group 1 is less than the mean mass of group 2.",
        "Choice C": "The median mass of group 1 is greater than the median mass of group 2.",
        "Choice D": "The median mass of group 1 is less than the median mass of group 2.",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. The median of a data set represented in a box plot is represented by the vertical line within the box. It follows that the median mass of the gazelles in group $1$ is $25$ kilograms, and the median mass of the gazelles in group $2$ is $24$ kilograms. Since $25$ kilograms is greater than $24$ kilograms, the median mass of group $1$ is greater than the median mass of group $2$. Choice A is incorrect. The mean mass of each of the two groups cannot be determined from the box plots. Choice B is incorrect. The mean mass of each of the two groups cannot be determined from the box plots. Choice D is incorrect and may result from conceptual or calculation errors.",
        "Table": "",
        "Figure": "2 box plots labeled Group 1 and Group 2. The number line is labeled Mass, in kilograms. It ranges from 20 to 32 in increments of 1, with values marked every 2 tick marks. Refer to long description. From left to right the values of the vertical bars in the Group 1 box plot are as follows: First vertical bar: 21 Second vertical bar: 22 Third vertical bar: 25 Fourth vertical bar: 26 Fifth vertical bar: 28 From left to right the values of the vertical bars in the Group 2 box plot are as follows: First vertical bar: 22 Second vertical bar: 23 Third vertical bar: 24 Fourth vertical bar: 25 Fifth vertical bar: 28"
    },
    {
        "Question ID": "d693f563",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Percentages",
        "Question Difficulty": "Medium",
        "Item Stem": "Last year, Cedric had $35$ plants in his garden. This year, the number of plants in Cedric's garden is $60\\%$ greater than the number of plants in his garden last year.",
        "Question": "How many plants does Cedric have in his garden this year?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": "56",
        "Rationale": "The correct answer is $56$. It's given that Cedric had $35$ plants in his garden last year and that the number of plants in Cedric's garden this year is $60\\%$ greater than the number of plants in his garden last year. It follows that the number of plants in Cedric's garden this year is $35$ plus $60\\%$ of $35$, which is equal to $35 + 35(\\frac{60}{100})$, or $35 + 35(0.6)$. This expression is equivalent to $35 + 21$, or $56$. Therefore, Cedric has $56$ plants in his garden this year.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "20845d36",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Percentages",
        "Question Difficulty": "Hard",
        "Item Stem": "The number $a$ is $70\\%$ less than the positive number $b$ . The number $c$ is $60\\%$ greater than $a$.",
        "Question": "The number $c$ is how many times $b$?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": ".48,  12/25",
        "Rationale": "The correct answer is $0.48$. It's given that the number $a$ is $70\\%$ less than the positive number $b$ . Therefore, $a = (1 - \\frac{70}{100}) b$ , which is equivalent to $a = (1 - 0.70) b$ , or $a = 0.30 b$ . It's also given that the number $c$ is $60\\%$ greater than $a$ . Therefore, $c = (1 + \\frac{60}{100}) a$ , which is equivalent to $c = (1 + 0.60) a$ , or $c = 1.60 a$ . Since $a = 0.30 b$ , substituting $0.30 b$ for $a$ in the equation $c = 1.60 (0.30 b)$ , or $c = 0.48 b$ . Thus, $c$ is $0.48$ times $b$ . Note that .48 and 12/25 are examples of ways to enter a correct answer.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "b2f6f17d",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Percentages",
        "Question Difficulty": "Medium",
        "Item Stem": "A customer's monthly water bill was $75.74. Due to a rate increase, her monthly bill is now $79.86.",
        "Question": "To the nearest tenth of a percent, by what percent did the amount of the customer's water bill increase?",
        "Choice A": "4.1\\%",
        "Choice B": "5.1\\%",
        "Choice C": "5.2\\%",
        "Choice D": "5.4\\%",
        "Correct Answer": "D",
        "Rationale": "Choice D is correct. To find the percent increase of the customer's water bill, the absolute increase of the bill, in dollars, is divided by the original amount of the bill, and the result is multiplied by 100\\%, as follows: $\\frac{79.86 - 75.74}{75.74} \\approx 0.054$ ; $0.054 \\times 100\\% = 5.4\\%$ . Choice A is incorrect. This choice is the difference $79.86 - 75.74$ rounded to the nearest tenth, which is the (absolute) increase of the bill's amount, not its percent increase. Choice B is incorrect and may be the result of some calculation errors. Choice C is incorrect and is the result of dividing the difference between the two bill amounts by the new bill amount instead of the original bill amount.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "6a715bed",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Probability and conditional probability",
        "Question Difficulty": "Hard",
        "Item Stem": "The table summarizes the distribution of age and assigned group for $90$ participants in a study. One of these participants will be selected at random. ",
        "Question": "What is the probability of selecting a participant from group A, given that the participant is at least $10$ years of age. (Express your answer as a decimal or fraction, not as a percent)?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": ".3833,  23/60",
        "Rationale": "The correct answer is $\\frac{23}{60}$ . It's given that one of the participants will be selected at random. The probability of selecting a participant from group A given that the participant is at least $10$ years of age is the number of participants in group A who are at least $10$ years of age divided by the total number of participants who are at least $10$ years of age. The table shows that in group A, there are $14$ participants who are $10$ - $19$ years of age and $9$ participants who are $20+$ years of age. Therefore, there are $14 + 9$ , or $23$ , participants in group A who are at least $10$ years of age. The table also shows that there are a total of $30$ participants who are $10$ - $19$ years of age and $30$ participants who are $20+$ years of age. Therefore, there are a total of $30 + 30$ , or $60$ , participants who are at least $10$ years of age. It follows that the probability of selecting a participant from group A given that the participant is at least $10$ years of age is $\\frac{23}{60}$ . Note that 23/60, .3833, and 0.383 are examples of ways to enter a correct answer.",
        "Table": "\\begin{tabular}{|c|c|c|c|c|} \\hline &  $0$ - $9$ years &  $10$ - $19$ years &  $20+$ years & Total \\\\ \\hline Group A &  $7$ &  $14$ &  $9$ &  $30$ \\\\ \\hline Group B &  $6$ &  $4$ &  $20$ &  $30$ \\\\ \\hline Group C &  $17$ &  $12$ &  $1$ &  $30$ \\\\ \\hline Total &  $30$ &  $30$ &  $30$ &  $90$ \\\\ \\hline \\end{tabular}",
        "Figure": ""
    },
    {
        "Question ID": "e9ed719f",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Probability and conditional probability",
        "Question Difficulty": "Medium",
        "Item Stem": "The table summarizes the distribution of color and shape for $100$ tiles of equal area.",
        "Question": "If one of these tiles is selected at random, what is the probability of selecting a red tile. (Express your answer as a decimal or fraction, not as a percent)?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": ".3,  3/10",
        "Rationale": "The correct answer is $\\frac{3}{10}$. It's given that there are a total of $100$ tiles of equal area, which is the total number of possible outcomes. According to the table, there are a total of $30$ red tiles. The probability of an event occurring is the ratio of the number of favorable outcomes to the total number of possible outcomes. By definition, the probability of selecting a red tile is given by $\\frac{30}{100}$, or $\\frac{3}{10}$. Note that 3/10 and .3 are examples of ways to enter a correct answer.",
        "Table": "\\begin{tabular}{|c|c|c|c|c|}\\hline & Red & Blue & Yellow & Total \\\\ \\hline Square &  $10$ &  $20$ &  $25$ &  $55$ \\\\ \\hline Pentagon &  $20$ &  $10$ &  $15$ &  $45$ \\\\ \\hline Total &  $30$ &  $30$ &  $40$ &  $100$ \\\\ \\hline\\end{tabular}",
        "Figure": ""
    },
    {
        "Question ID": "2df8f293",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Probability and conditional probability",
        "Question Difficulty": "Medium",
        "Item Stem": "Each vertex of a $14$-sided polygon is labeled with one of the $14$ letters $A$ through $N$, with a different letter at each vertex. ",
        "Question": "If one vertex is selected at random, what is the probability that the letter $D$ will be at the selected vertex. (Express your answer as a decimal or fraction, not as a percent)?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": ".0714,  1/14",
        "Rationale": "The correct answer is $\\frac{1}{14}$. If one vertex of the polygon is selected at random, the probability that the letter $D$ will be at the selected vertex is equal to the number of vertices labeled with the letter $D$ divided by the total number of vertices. It's given that each vertex is labeled with one of the $14$ letters $A$ through $N$, with a different letter at each vertex. It follows that there is $1$ vertex labeled with the letter $D$. It's also given that the polygon is $14$-sided. It follows that there are a total of $14$ vertices. Thus, the probability that the letter $D$ will be at the selected vertex is $\\frac{1}{14}$. Note that 1/14, .0714, and 0.071 are examples of ways to enter a correct answer.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "b4912cc5",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Ratios, rates, proportional relationships, and units",
        "Question Difficulty": "Medium",
        "Item Stem": "The population density of Iceland, in people per square kilometer of land area, increased from 2.5 in 1990 to 3.3 in 2014. During this time period, the land area of Iceland was 100,250 square kilometers.",
        "Question": "By how many people did Iceland's population increase from 1990 to 2014?",
        "Choice A": "330,825",
        "Choice B": "132,330",
        "Choice C": "125,312",
        "Choice D": "80,200",
        "Correct Answer": "D",
        "Rationale": "Choice D is correct. The increase in Iceland's population can be found by multiplying the increase in population density, in people per square kilometer, by the area, in square kilometers. It's given that the population density of Iceland was 2.5 people per square kilometer in 1990 and 3.3 people per square kilometer in 2014. The increase in population density can be found by subtracting 2.5 from 3.3, which yields 0.8. It's given that the land area of Iceland was 100,250 square kilometers. Thus, the increase in population is $0.8 \\times 100,250$, or 80,200. Alternate approach: It's given that the population density of Iceland, in people per square kilometer of land area, in 1990 was 2.5. Since the land area of Iceland was 100,250 square kilometers, it follows that the population of Iceland in 1990 was $2.5 \\times 100,250$, or 250,625. Similarly, the population of Iceland in 2014 was $3.3 \\times 100,250$, or 330,825. The population increase is the difference in the population from 1990 to 2014, or $330,825 - 250,625$, which yields 80,200. Therefore, Iceland's population increased by 80,200 from 1990 to 2014. Choice A is incorrect. This is the population of Iceland in 2014. Choice B is incorrect and may result from dividing 3.3 by 2.5, instead of subtracting 2.5 from 3.3. Choice C is incorrect and may result from dividing the population of Iceland in 1990 by 2.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "e21d10a7",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Ratios, rates, proportional relationships, and units",
        "Question Difficulty": "Medium",
        "Item Stem": "One of a planet's moons orbits the planet every $252$ days. A second moon orbits the planet every $287$ days.",
        "Question": "How many more days does it take the second moon to orbit the planet $29$ times than it takes the first moon to orbit the planet $29$ times?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": "1015",
        "Rationale": "The correct answer is $1,015$. It's given that the first moon orbits the planet every $252$ days. Therefore, it takes the first moon $252 (29)$, or $7,308$, days to orbit the planet $29$ times. It's also given that the second moon orbits the planet every $287$ days. Therefore, it takes the second moon $287 (29)$, or $8,323$, days to orbit the planet $29$ times. Since it takes the first moon $7,308$ days and the second moon $8,323$ days, it takes the second moon $8,323 - 7,308$, or $1,015$, more days than it takes the first moon to orbit the planet $29$ times.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "0700a2d5",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Ratios, rates, proportional relationships, and units",
        "Question Difficulty": "Easy",
        "Item Stem": "",
        "Question": "How many yards are equivalent to $77$ rods. $(5.5\\ yards=1\\ rod)$?",
        "Choice A": "",
        "Choice B": "",
        "Choice C": "",
        "Choice D": "",
        "Correct Answer": "423.5,  847/2",
        "Rationale": "The correct answer is $423.5$. It's given that $5.5 yards equals 1 rod$. Therefore, $77$ rods is equivalent to $(77\\ rods) (\\frac{5.5\\ yards}{1\\ rod})$ , or $423.5$ yards. Note that 423.5 and 847/2 are examples of ways to enter a correct answer.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "e6f2ace7",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Right triangles and trigonometry",
        "Question Difficulty": "Easy",
        "Item Stem": "The lengths of the legs of a right triangle are shown.",
        "Question": "Which of the following is closest to the length of the triangle's hypotenuse?",
        "Choice A": "$3.2$",
        "Choice B": "$5$",
        "Choice C": "$7.6$",
        "Choice D": "$20$",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. The Pythagorean theorem states that for a right triangle, $a^2 + b^2 = c^2$, where $a$ and $b$ represent the lengths of the legs of the triangle and $c$ represents the length of its hypotenuse. In the triangle shown, the legs have lengths of $3$ and $7$. Substituting $3$ for $a$ and $7$ for $b$ in the equation $a^2 + b^2 = c^2$ yields $3^2 + 7^2 = c^2$, which is equivalent to $9 + 49 = c^2$, or $58 = c^2$. Taking the positive square root of both sides of this equation yields $\\sqrt{58}=c$. Thus, the value of $c$ is approximately $7.6$. Therefore, of the given choices, $7.6$ is the closest to the length of the triangle's hypotenuse. Choice A is incorrect and may result from conceptual or calculation errors. Choice B is incorrect and may result from conceptual or calculation errors. Choice D is incorrect and may result from conceptual or calculation errors.",
        "Table": "",
        "Figure": "A right triangle. Refer to long description. One angle is a right angle. The lengths of the sides adjacent to the right angle are as follows: 3 7 A note indicates the figure is not drawn to scale."
    },
    {
        "Question ID": "52f7b898",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Right triangles and trigonometry",
        "Question Difficulty": "Hard",
        "Item Stem": "Right triangle $ABC$ is shown.",
        "Question": "What is the value of $\\tan A$?",
        "Choice A": "$\\frac{\\sqrt{3}}{54}$",
        "Choice B": "$\\frac{1}{\\sqrt{3}}$",
        "Choice C": "$\\sqrt{3}$",
        "Choice D": "$27 \\sqrt{3}$",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. In the triangle shown, the measure of angle $B$ is $30 degree$ and angle $C$ is a right angle, which means that it has a measure of $90 degree$. Since the sum of the angles in a triangle is equal to $180 degree$, the measure of angle $A$ is equal to $180 degree - ( 30 + 90 ) degree$, or $60 degree$. In a right triangle whose acute angles have measures $30 degree$ and $60 degree$, the lengths of the legs can be represented by the expressions $x$, $x \\sqrt{3}$, and $2 x$, where $x$ is the length of the leg opposite the angle with measure $30 degree$, $x \\sqrt{3}$ is the length of the leg opposite the angle with measure $60 degree$, and $2 x$ is the length of the hypotenuse. In the triangle shown, the hypotenuse has a length of $54$. It follows that $2 x = 54$, or $x = 27$. Therefore, the length of the leg opposite angle $B$ is $27$ and the length of the leg opposite angle $A$ is $27 \\sqrt{3}$. The tangent of an acute angle in a right triangle is defined as the ratio of the length of the leg opposite the angle to the length of the leg adjacent to the angle. The length of the leg opposite angle $A$ is $27 \\sqrt{3}$ and the length of the leg adjacent to angle $A$ is $27$. Therefore, the value of $\\tan A$ is $\\frac{27 \\sqrt{3}}{27}$, or $\\sqrt{3}$. Choice A is incorrect and may result from conceptual or calculation errors. Choice B is incorrect. This is the value of $\\frac{1}{\\tan A}$, not the value of $\\tan A$. Choice D is incorrect. This is the length of the leg opposite angle $A$, not the value of $\\tan A$.",
        "Table": "",
        "Figure": "Right triangle ABC. Refer to long description. The length of side AB is 54. The measure of angle B is 30$^{\\circ}$. Angle C is a right angle. A note indicates the figure is not drawn to scale."
    },
    {
        "Question ID": "33e29881",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Geometry and Trigonometry",
        "Skill": "Right triangles and trigonometry",
        "Question Difficulty": "Medium",
        "Item Stem": "In right triangle $RST$ , the sum of the measures of angle $R$ and angle $S$ is $90$ degrees. The value of $\\sin(R)$ is $\\frac{\\sqrt{15}}{4}$.",
        "Question": "What is the value of $\\cos(S)$?",
        "Choice A": " $\\frac{\\sqrt{15}}{15}$",
        "Choice B": " $\\frac{\\sqrt{15}}{4}$",
        "Choice C": " $\\frac{4 \\sqrt{15}}{15}$",
        "Choice D": " $\\sqrt{15}$",
        "Correct Answer": "B",
        "Rationale": "Choice B is correct. The sine of any acute angle is equal to the cosine of its complement. It's given that in right triangle $RST$ , the sum of the measures of angle $R$ and angle $S$ is $90$ degrees. Therefore, angle $R$ and angle $S$ are complementary, and the value of $\\sin R$ is equal to the value of $\\cos S$ . It's given that the value of $\\sin R$ is $\\frac{\\sqrt{15}}{4}$ , so the value of $\\cos S$ is also $\\frac{\\sqrt{15}}{4}$ . Choice A is incorrect. This is the value of $\\tan S$ . Choice C is incorrect. This is the value of $\\frac{1}{\\cos S}$ . Choice D is incorrect. This is the value of $\\frac{1}{\\tan S}$ .",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "e0177f5f",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Systems of two linear equations in two variables",
        "Question Difficulty": "Easy",
        "Item Stem": "$x=4$ $y=5 - x$ The solution to the given system of equations is $(x, y)$.",
        "Question": "What is the value of $y$?",
        "Choice A": " $1$",
        "Choice B": " $4$",
        "Choice C": " $5$",
        "Choice D": " $9$",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. The first equation in the given system of equations is $x=4$ . Substituting $4$ for $x$ in the second equation in the given system of equations yields $y=5 - 4$ , or $y=1$ . Choice B is incorrect. This is the value of $x$ in the solution to the given system of equations, not the value of $y$ . Choice C is incorrect and may result from conceptual or calculation errors. Choice D is incorrect and may result from conceptual or calculation errors.",
        "Table": "",
        "Figure": ""
    },
    {
        "Question ID": "e1259a5a",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Systems of two linear equations in two variables",
        "Question Difficulty": "Easy",
        "Item Stem": "",
        "Question": "Which of the following points is the solution to the system of equations?",
        "Choice A": " the point with coordinates $(3,9)$",
        "Choice B": " the point with coordinates $(6,15)$",
        "Choice C": " the point with coordinates $(8,10)$",
        "Choice D": " the point with coordinates $(12,18)$",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. The solution to this system of linear equations is the point that lies on both lines graphed, or the point of intersection of the two lines. According to the graphs, the point of intersection occurs when $x=3$ and $y=9$ , or at the point $(3,9)$. Choices B and D are incorrect. Each of these points lies on one line, but not on both lines in the xy-plane. Choice C is incorrect. This point doesn't lie on either of the lines graphed in the xy-plane.",
        "Table": "",
        "Figure": "The figure presents the graph of 2 lines in the x y plane. The numbers negative 4 through 16, in increments of 2, are indicated on the x axis. The numbers negative 4 through 20, in increments of 2, are indicated on the y axis. One line begins above the x axis and to the left of the y axis. It moves upward and to the right, crossing the y axis at 6, and passing through the point with coordinates 3 comma 9 and the point with coordinates 12 comma 18. The other line begins below the x axis and to the left of the y axis. It moves upward and to the right, crossing the y axis at 3, and passing through the point with coordinates 3 comma 9 and the point with coordinates 6 comma 15. The two lines intersect at the point with coordinates 3 comma 9."
    },
    {
        "Question ID": "2704399f",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Algebra",
        "Skill": "Systems of two linear equations in two variables",
        "Question Difficulty": "Medium",
        "Item Stem": "",
        "Question": "Which of the following systems of equations has the same solution as the system of equations graphed above?",
        "Choice A": "Equation 1: $y=0$. Equation 2: $x=\\frac{3}{2}$",
        "Choice B": "Equation 1: $y=\\frac{3}{2}$. Equation 2: $x=0$",
        "Choice C": "Equation 1: $y=0$. Equation 2: $x=1$",
        "Choice D": "Equation 1: $y=1$. Equation 2: $x=0$",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. The solution to a system of equations is the coordinates of the intersection point of the graphs of the equations in the xy -plane. Based on the graph, the solution to the given system of equations is best approximated as $\\text{the point with coordinates } (\\frac{3}{2},0)$ . In the xy -plane, the graph of $y=0$ is a horizontal line on which every y -coordinate is 0, and the graph of $x=\\frac{3}{2}$ is a vertical line on which every x -coordinate is $\\frac{3}{2}$ . These graphs intersect at the point $\\text{with coordinates } (\\frac{3}{2},0)$ . Therefore, the system of equations in choice A has the same solution as the given system. Choices B, C, and D are incorrect. If graphed in the xy -plane, these choices would intersect at the points $\\text{with coordinates } (0, \\frac{3}{2})$ , $1,0$, and $0,1$ , respectively, not $\\text{the point with coordinates } (\\frac{3}{2},0)$ .",
        "Table": "",
        "Figure": "The figure presents the graph of two intersecting lines in the x y plane with the origin labeled O. The integers negative 5 through 5 are indicated on each axis. One line begins above the x axis and to the left of the y axis, and trends downward and to the right. It crosses the y axis between 0 and 1, then crosses the x axis between 1 and 2, and ends below the x axis and to the right of the y axis. The other line begins below the x axis and slightly to the left of the y axis, and trends upward and to the right. It crosses the y axis at negative 5, then crosses the x axis between 1 and 2, and ends above the x axis and to the right of the y axis. The two lines intersect at the point where both lines cross the x axis between 1 and 2."
    },
    {
        "Question ID": "af142f8d",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Two-variable data: Models and scatterplots",
        "Question Difficulty": "Hard",
        "Item Stem": "Two investments were made as shown in the table above. The interest in Account A is compounded once per year.",
        "Question": "Which of the following is true about the investments?",
        "Choice A": "Account A always earns more money per year than Account B.",
        "Choice B": "Account A always earns less money per year than Account B.",
        "Choice C": "Account A earns more money per year than Account B at first but eventually earns less money per year.",
        "Choice D": "Account A earns less money per year than Account B at first but eventually earns more money per year.",
        "Correct Answer": "A",
        "Rationale": "Choice A is correct. Account A starts with \\$500 and earns interest at 6\\% per year, so in the first year Account A earns (500)(0.06) = \\$30, which is greater than the \\$25 that Account B earns that year. Compounding interest can be modeled by an increasing exponential function, so each year Account A will earn more money than it did the previous year. Therefore, each year Account A earns at least \\$30 in interest. Since Account B always earns \\$25 each year, Account A always earns more money per year than Account B. Choices B and D are incorrect. Account A earns \\$30 in the first year, which is greater than the \\$25 Account B earns in the first year. Therefore, neither the statement that Account A always earns less money per year than Account B nor the statement that Account A earns less money than Account B at first can be true. Choice C is incorrect. Since compounding interest can be modeled by an increasing exponential function, each year Account A will earn more money than it did the previous year. Therefore, Account A always earns at least \\$30 per year, which is more than the \\$25 per year that Account B earns.",
        "Table": "\\begin{tabular}{|c|c|c|} \\hline & Amount invested & Balance increase \\\\ \\hline Account A & \\$500 & 6\\% annual interest \\\\ \\hline Account B & \\$1,000 & \\$25 per year \\\\ \\hline \\end{tabular}",
        "Figure": ""
    },
    {
        "Question ID": "4a2264b3",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Two-variable data: Models and scatterplots",
        "Question Difficulty": "Easy",
        "Item Stem": "The line graph shows the percent of cars for sale at a used car lot on a given day by model year.",
        "Question": "For what model year is the percent of cars for sale the smallest?",
        "Choice A": "$2012$",
        "Choice B": "$2013$",
        "Choice C": "$2014$",
        "Choice D": "$2015$",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. For the given line graph, the percent of cars for sale at a used car lot on a given day is represented on the vertical axis. The percent of cars for sale is the smallest when the height of the line graph is the lowest. The lowest height of the line graph occurs for cars with a model year of $2014$. Choice A is incorrect and may result from conceptual errors. Choice B is incorrect and may result from conceptual errors. Choice D is incorrect and may result from conceptual errors.",
        "Table": "",
        "Figure": "A line graph. The horizontal axis is labeled Model year. It ranges from 2010 to 2019 in increments of 1. The vertical axis is labeled Percent of cars for sale. It ranges from 0\\% to 15\\% in increments of 1, with values marked every 5 grid lines. Refer to long description. The line graph: Begins at 2010, 12\\% Remains level to 2011, 12\\% Remains level to 2012, 12\\% Falls sharply to 2013, 8\\% Falls sharply to 2014, 4\\% Rises sharply to 2015, 9\\% Rises gradually to 2016, 10\\% Remains level to 2017, 10\\% Rises gradually to 2018, 11\\% Remains level to 2019, 11\\%"
    },
    {
        "Question ID": "4cc05491",
        "Assessment": "SAT",
        "Test": "Math",
        "Domain": "Problem-Solving and Data Analysis",
        "Skill": "Two-variable data: Models and scatterplots",
        "Question Difficulty": "Medium",
        "Item Stem": "In the given scatterplot, a line of best fit for the data is shown.",
        "Question": "Which of the following is closest to the slope of the line of best fit shown?",
        "Choice A": "$0.2$",
        "Choice B": "$0.7$",
        "Choice C": "$1.8$",
        "Choice D": "$2.6$",
        "Correct Answer": "C",
        "Rationale": "Choice C is correct. A line in the xy -plane that passes through points $(x_1,y_1)$ and $(x_2,y_2)$ has a slope of $\\frac{y_2 - y_1}{x_2 - x_1}$ . The line of best fit shown passes approximately through the points $(0,0.2)$ and $(5,9.3)$ . It follows that the slope of this line is approximately $\\frac{9.3 - 0.2}{5 - 0}$ , which is equivalent to $\\frac{9.1}{5}$ , or $1.82$ . Therefore, of the given choices, $1.8$ is closest to the slope of the line of best fit shown. Choice A is incorrect. This value is closest to the y -coordinate of the y -intercept of the line of best fit shown. Choice B is incorrect and may result from conceptual or calculation errors. Choice D is incorrect and may result from conceptual or calculation errors.",
        "Table": "",
        "Figure": "A scatterplot in the x y plane with the origin labeled O. The x axis ranges from 0 to 10. The y axis ranges from 0 to 15. Refer to long description. The scatterplot has 5 data points. The data points are in a linear pattern trending up from left to right. A line of best fit is shown: The line of best fit slants up from left to right. The line of best fit passes through the following approximate coordinates: (0,0.2) (5,9.3)"
    }
]